# -*- coding: utf-8 -*-

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
df1=pd.read_csv("/Users/okazaki/Desktop/ロケスタjs/csv/schedules_rshd_分類済み_未分類含む.csv",encoding="UTF-8")

#df1=df1[["予定","作業時間"]]

#カテゴライズ作業
df1['分類'] = df1['予定'].mask(df1['予定'] == "社内MTG/面談(オンライン)", "社内MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "社内MTG/面談（茨）", "社内MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "TASK", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "セミナー", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "チェック", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "プライベート", "プライベート")
df1['分類'] = df1['分類'].mask(df1['予定'] == "移動", "移動")
df1['分類'] = df1['分類'].mask(df1['予定'] == "会食/会合", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "休暇", "プライベート")
df1['分類'] = df1['分類'].mask(df1['予定'] == "在宅", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "社内MTG/面談（栃）", "社内MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "修正作業（ローカル）", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "商談/打ち合わせ(オンライン)", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "商談/打合せ（茨）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "商談/打合せ（東京/他）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "締切", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "訪問", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "来ロケスタ 商談/MTG", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "GOLF", "プライベート")
df1['分類'] = df1['分類'].mask(df1['予定'] == "☆経営者 商談/打合せ", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "☆経営者 来ロケスタ 商談/打合せ", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "TEL", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "まとまりTASK", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "メール", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "リモートワーク", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "開発作業（都内）", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "採用面接・説明会", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "取材・撮影（茨城）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "取材（オンライン）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "取材（茨城）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "取材（東京/他）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "取材（栃木）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "修正作業（ローカル）", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "出勤", "移動")
df1['分類'] = df1['分類'].mask(df1['予定'] == "取材（東京/他）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "商談/打合せ（栃）", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "請求書発行", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "問い合わせ対応（都内）", "個人作業")
df1['分類'] = df1['分類'].mask(df1['予定'] == "面接/説明会", "社外MTG")
df1['分類'] = df1['分類'].mask(df1['予定'] == "商談/打合せ（栃）", "社外MTG")
#空白セルの処理
df1=df1.fillna(0)
df1['分類'] = df1['分類'].mask(df1['予定'] == 0, "未分類")

print(df1)

#print(df1[df1["参加者/組織/施設（表示名）"] == '堀内 可那江'])


